app/views/survey_rates/survey.html.erb

SELECT "surveys".* FROM "surveys"
---
<%= form_for :survey_rate, :url => {:action => "create"} do |f| %>
    <%= @surveys.first['survey'] %><br />