app/views/suggest_rates/suggest.html.erb

<%= form_for :suggest_rate, :url => {:action => "create"} do |f| %>
    <%= @suggests.first['suggest'] %><br />
---
SELECT "suggests".* FROM "suggests"