app/controllers/pages_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = -1) LIMIT 1
---
		def continue
    if cookies.signed[:user_id] == -1
      @username = "Guest"
    else
      user = User.find(cookies.signed[:user_id])