app/controllers/suggest_rates_controller.rb

  def suggest
		@surveys = Survey.find(params[:id])
		@suggests = Suggest.all
---
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 1) LIMIT 1
SELECT "suggests".* FROM "suggests"