app/controllers/survey_suggests_controller.rb

SELECT "surveys".* FROM "surveys"
---
	def chooseSurvey
		@surveys = Survey.all

SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 1) LIMIT 1
---
	def editSurvey
		@survey = Survey.find(params[:id])

SELECT "surveys".* FROM "surveys"
---
	def whichSurvey
  	@surveys = Survey.all

SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 1) LIMIT 1
UPDATE "surveys" SET "survey" = 'Survey 2', "updated_at" = '2011-04-24 06:56:16.384943' WHERE ("surveys"."id" = 1)
---
	def updateSurvey
		@survey = Survey.find(params[:survey][:id])
		if @survey.update_attributes(:survey => params[:survey][:survey])

SELECT "suggests".* FROM "suggests" WHERE ("suggests"."id" = 1) LIMIT 1
---
	def editSuggest
		@suggest = Suggest.find(params[:id])

SELECT "suggests".* FROM "suggests"
---
	def whichSuggest
  	@suggests = Suggest.all

SELECT "suggests".* FROM "suggests" WHERE ("suggests"."id" = 1) LIMIT 1
UPDATE "suggests" SET "suggest" = 'Suggestion A' WHERE ("suggests"."id" = 1)
---
	def updateSuggest
		@suggest = Suggest.find(params[:suggest][:id])
		if @suggest.update_attributes(:suggest => params[:suggest][:suggest])