app/controllers/survey_rates_controller.rb

	def survey
		@surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"