app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def index
		@users = User.find(:all, :order => 'username')

SELECT "users".* FROM "users"
---
	def chooseUser
		@users = User.all

SELECT "users".* FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "users" SET "name" = 'Jane Doe', "username" = 'Jane' WHERE ("users"."id" = 3)
---
	def update
		@user = User.find(params[:user][:id])
		if @user.update_attributes(:name => params[:user][:name],
			:username => params[:user][:username], :division => params[:user][:division],
			:department => params[:user][:department])