app/controllers/user_suggestions_controller.rb

	def edit
		@suggestion = Suggestion.find(params[:id])
---
SELECT "suggestions".* FROM "suggestions" WHERE ("suggestions"."id" = 3) LIMIT 1

	def chooseSuggestion
  	user = User.find(cookies.signed[:user_id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1